## Plan for org_account/roles
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
OIDC.tf
locals.tf
```
```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_iam_policy.org_account_list_all`                     |
|        | `aws_iam_role_policy_attachment.attach_list_accounts_all` |
|        | `module.OIDC_Roles.aws_iam_role.this[&quot;listAllAccounts&quot;]`  |
| update | `aws_iam_role.sre_bot`                                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.org_account_list_all will be created
  + resource "aws_iam_policy" "org_account_list_all" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "listAllAccounts"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "organizations:ListAccounts"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:organizations::659087519042:ou/o-625no8z3dd/*"
                      + Sid      = "listAllAccounts"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.sre_bot will be updated in-place
  ~ resource "aws_iam_role" "sre_bot" {
      ~ assume_role_policy    = (sensitive value)
        id                    = "sre_bot_role"
        name                  = "sre_bot_role"
        tags                  = {
            "CostCentre" = "cds-aws-lz-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.attach_list_accounts_all will be created
  + resource "aws_iam_role_policy_attachment" "attach_list_accounts_all" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "listAllAccounts"
    }

  # module.OIDC_Roles.aws_iam_role.this["listAllAccounts"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:cds-snc/site-reliability-engineering:ref:refs/heads/main",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::659087519042:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "listAllAccounts"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_account_list_all"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_account_list_in_sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.org_allow_policy_toggle"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.administration_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.config_terraform_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.s3_replicate"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
